# main.py

from Microgrid import Microgrid, Optimization_microgrid
#全局
C_buy = [0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.53, 0.53, 0.53, 0.82, 0.82,
        0.82, 0.82, 0.82, 0.53, 0.53, 0.53, 0.82, 0.82, 0.82, 0.53, 0.53, 0.53]

C_sell = [0.22, 0.22, 0.22, 0.22, 0.22, 0.22, 0.22, 0.42, 0.42, 0.42, 0.65, 0.65,
         0.65, 0.65, 0.65, 0.42, 0.42, 0.42, 0.65, 0.65, 0.65, 0.42, 0.42, 0.42]

# 定义 gridB 的参数
# 定义 gridB 的光伏发电能力和负载
P_pv = [43.6351830380341, 5.40581541514531, 32.8358719758836, 19.0009117783515,
        39.1178845139782, 64.4853270641430, 30.2278361336943, 41.4382515605911,
        7.56783114759613, 72.7276154279869, 16.6104475197874, 30.5651618832424,
        52.8224212142948, 60.6698641822058, 13.8455529913677, 41.3903809205061,
        79.6270489842773, 56.6087525272567, 6.44538407391447, 3.46464771000820,
        39.2924450387408, 35.7277152135362, 38.9438852676276, 13.2712897668273]
# 将某些小时的PV能力设置为0
for hour in [0, 1, 2, 3, 4, 5, 19, 20, 21, 22, 23]:
    P_pv[hour] = 0

load = [2 * x for x in [88.24, 83.01, 80.15, 79.01, 76.07, 78.39, 89.95, 248.85,
                        55.45, 76.35, 93.71, 82.57, 79.64, 66.31, 164.61, 164.61,
                        174.48, 203.93, 218.99, 238.11, 216.14, 173.87, 131.07, 94.04]]

ebattery = 300  # 电池容量
soc0 = 0.5  # 初始SOC
socmin = 0.3  # 最小SOC
socmax = 0.95  # 最大SOC
pcs = 40  # 充/放电功率限制
C_buy = 0.1  # 购电价格
C_sell = 0.05  # 售电价格
amt = 0.7939  # 燃气轮机成本系数
POWER = 300  # 主网功率交换限制

# 创建 Microgrid 实例
gridB = Microgrid(P_pv, load, ebattery, soc0, socmin, socmax, pcs)

# 创建 Optimization 实例并求解
optimization = Optimization_microgrid(gridB, POWER, ebattery, socmin, socmax, soc0, pcs, C_buy, C_sell, amt)
optimization.solve()
